pickupRequest/xml/pickupRequest.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/pickup/v11">
   <SOAP-ENV:Body>
      <CreatePickupRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key/>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber/>
            <MeterNumber/>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId/>
         </TransactionDetail>
         <Version>
            <ServiceId>disp</ServiceId>
            <Major>11</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <OriginDetail>
            <UseAccountAddress/>
            <PickupLocation>
               <Contact>
                  <PersonName/>
                  <CompanyName/>
                  <PhoneNumber/>
                  <EMailAddress/>
               </Contact>
               <Address>
                  <StreetLines/>
                  <City/>
                  <StateOrProvinceCode/>
                  <PostalCode/>
                  <CountryCode/>
               </Address>
            </PickupLocation>
            <PackageLocation>FRONT</PackageLocation>
            <BuildingPartDescription>SUITE</BuildingPartDescription>
            <ReadyTimestamp/>
            <CompanyCloseTime/>
         </OriginDetail>
         <PackageCount/>
         <TotalWeight>
            <Units/>
            <Value/>
         </TotalWeight>
         <CarrierCode>FDXE</CarrierCode>
         <Remarks/>
      </CreatePickupRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
